In [1]:
import pandas as pd

In [2]:
big = pd.DataFrame({'department':['A','A','B','B'], 'gender':['male','female','male','female'],'count':[1,2,3,1]})
small = pd.DataFrame({'department':['A','B'], 'total':[3,4]})

In [3]:
display("big",big)
display("small",small)

'big'

  department  gender  count
0          A    male      1
1          A  female      2
2          B    male      3
3          B  female      1

'small'

  department  total
0          A      3
1          B      4

In [12]:
pd.merge(big,small) 
big.merge(small)
pd.merge(small,big) 
small.merge(big)

  department  total  gender  count
0          A      3    male      1
1          A      3  female      2
2          B      4    male      3
3          B      4  female      1

In [16]:
big.merge(small,on='department')

  department  gender  count  total
0          A    male      1      3
1          A  female      2      3
2          B    male      3      4
3          B  female      1      4

`# 예제2`

In [30]:
big = pd.DataFrame({
    'department':['A']*4+['B']*4, 
    'gender':(['male']*2+['female']*2)*2,
    'repeat':['Yes','No']*4,
    'count':[1,2,3,1,4,5,2,0]}
)
small = pd.DataFrame({'department':['A','B'], 'total':[3,4]})

In [31]:
big

  department  gender repeat  count
0          A    male    Yes      1
1          A    male     No      2
2          A  female    Yes      3
3          A  female     No      1
4          B    male    Yes      4
5          B    male     No      5
6          B  female    Yes      2
7          B  female     No      0

In [25]:
s1 = pd.DataFrame({
    'name':['이성계','이방원','정몽주','하륜'],
    'desc':['왕','이성계의 아들','이성계의 신하','이방원의 부하']})
s1

  name     desc
0  이성계        왕
1  이방원  이성계의 아들
2  정몽주  이성계의 신하
3   하륜  이방원의 부하

In [26]:
s2 = pd.DataFrame({
    'name':['이방원','이성계','하륜'],
    'desc':['왕','왕의 아버지','이성계의 신하']})
s2

  name     desc
0  이방원        왕
1  이성계   왕의 아버지
2   하륜  이성계의 신하

In [28]:
s1.merge(s2,on='name')

  name   desc_x   desc_y
0  이성계        왕   왕의 아버지
1  이방원  이성계의 아들        왕
2   하륜  이방원의 부하  이성계의 신하

In [16]:
학생 = pd.DataFrame({
    '이름': ['지민', '태형', '윤기', '호석'],
    '동아리': ['음악', '미술', '체육', '음악']
})

동아리 = pd.DataFrame({
    '동아리': ['음악', '미술', '체육', '과학'],
    '선생님': ['김선생님', '이선생님', '박선생님', '최선생님']
})

결과 = 학생.merge(동아리, left_on='동아리', right_on='동아리',how='outer')
결과

    이름 동아리   선생님
0   지민  음악  김선생님
1   호석  음악  김선생님
2   태형  미술  이선생님
3   윤기  체육  박선생님
4  NaN  과학  최선생님

In [10]:
학생 = pd.DataFrame({
    '이름': ['지민', '태형', '윤기', '호석'],
    '동아리': ['음악', '미술', '체육', '음악'],
    '학년': [1, 2, 3, 1]
})

동아리 = pd.DataFrame({
    '동아리': ['음악', '미술', '체육', '과학'],
    '학년': [1, 2, 3, 4],
    '선생님': ['김선생님', '이선생님', '박선생님', '최선생님']
})

결과 = 학생.merge(동아리)
결과

   이름 동아리  학년   선생님
0  지민  음악   1  김선생님
1  호석  음악   1  김선생님
2  태형  미술   2  이선생님
3  윤기  체육   3  박선생님